#Область ПрограммныйИнтерфейс

#Область Инициатор
Процедура ЗапускПриложения(ПараметрыЗапускаПрограммы) Экспорт
	
	ЗаписьЖурналаРегистрации("GIT",,,, ПараметрыЗапускаПрограммы.СтрокаКоманды);
	ДополнительныеПараметры = НовыйДополнительныеПараметры();
	ЮРЛАгентаБазы = ПараметрыЗапускаПрограммы.ЮРЛАгентаБазы + "/script";
	ПараметрыЗапускаПрограммы = КоннекторHTTP.PostJson(ЮРЛАгентаБазы, ПараметрыЗапускаПрограммы, ДополнительныеПараметры);
	Если ПараметрыЗапускаПрограммы.Свойство("Error") Тогда
		ВызватьИсключение("Запрос к агенту не отработал, скорее всего что то с именем публикации", 
			КатегорияОшибки.ОшибкаСети, "ОшибкаЗапускаПрограммы", "Ошибка запроса");
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьВывод(ПараметрыЗапускаПрограммы) Экспорт
	
	ДополнительныеПараметры = НовыйДополнительныеПараметры();

	ЮРЛАгентаБазы = ПараметрыЗапускаПрограммы.ЮРЛАгентаБазы + "/logs";
	ДанныеЛогов = КоннекторHTTP.Post(ЮРЛАгентаБазы, ОбщегоНазначения.ЗначениеВJSON(ПараметрыЗапускаПрограммы)
		, ДополнительныеПараметры);
		
	Если Не ЗначениеЗаполнено(ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере) Тогда
		ПутьКПапке = Константы.ПутьКПапкеДевопсСервера.Получить();
		ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере = СтратегияЗапускаСкриптов.ИмяВременногоФайла(ПутьКПапке);

	КонецЕсли;
	ДанныеЛогов.Тело.Записать(ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере);
	
КонецПроцедуры

#КонецОбласти


#Область Обработчик

Функция ОбработкаВходящегоЗапроса(ТелоЗапроса) Экспорт

	ПараметрыЗапускаПрограммы = ОбщегоНазначения.JSONВЗначение(ТелоЗапроса,, Ложь);
	ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВывода = 
		СтратегияЗапускаСкриптов.ИмяВременногоФайла(ПараметрыЗапускаПрограммы.ПутьКПапкеДевопс);
		
	ЗапускПриложенийЧерезCMD.ЗапускПриложения(ПараметрыЗапускаПрограммы);
	
	Возврат ОбщегоНазначения.ЗначениеВJSON(ПараметрыЗапускаПрограммы);
	
КонецФункции

Функция ОбработкаВходящегоЗапросаПоЛогам(ДанныеЛогов) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеЛогов.ИмяФайлаПотокаВывода) Тогда
		Возврат ДанныеЛогов.ИмяФайлаПотокаВывода;
	КонецЕсли;
	Возврат "";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция НовыйДополнительныеПараметры()
	
	//TODO НИКОГДА ТАК НЕ ДЕЛАЙ!! Воробьев ВА (Пасхалочка)
	Аутентификация = Новый Структура("Пользователь, Пароль", "web", "web");
	
	ПараметрыПреобразования = Новый Структура;
	ПараметрыПреобразования.Вставить("ПрочитатьВСоответствие", Ложь);
	
	Возврат Новый Структура("Аутентификация, ПараметрыПреобразованияJSON", Аутентификация, ПараметрыПреобразования);
	
КонецФункции
#КонецОбласти