#Область ОбработчикиСобытий

Функция scriptpost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЗаписьЖурналаРегистрации("GIT.HTTP.script", УровеньЖурналаРегистрации.Информация,,, ТелоЗапроса); 
	Если ПустаяСтрока(ТелоЗапроса) Тогда
		ТелоОтвета = "{""Error"": true}";
	Иначе
		ТелоОтвета = ЗапускПриложенияЧерезHTTP.ОбработкаВходящегоЗапроса(ТелоЗапроса);
	КонецЕсли;
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция logspost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("GIT.HTTP.log", 
		УровеньЖурналаРегистрации.Информация,,, ТелоЗапроса
	);  
	ОтветПараметры = ОбщегоНазначения.JSONВЗначение(ТелоЗапроса,, Ложь);
	ПутьКФайлу = ЗапускПриложенияЧерезHTTP.ОбработкаВходящегоЗапросаПоЛогам(ОтветПараметры);
	ИмяФайлаКопия  = СтратегияЗапускаСкриптов.ИмяВременногоФайла(ОтветПараметры.ПутьКПапкеДевопс);
	КопироватьФайл(ПутьКФайлу, ИмяФайлаКопия);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаКопия);
	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	УдалитьФайлы(ИмяФайлаКопия);
	
	РаботаСЛогами.УдалитьОсновнойФайлЛоговПриВыполненииОперации(ПутьКФайлу);
	
	Возврат Ответ;
	
КонецФункции

Функция pingping(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Успех");
	Возврат Ответ;
КонецФункции

Функция ChangeVersionChangeVersion(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	РаботаСВерсиямиОбработок.ИзменитьВерсииОбработок(ТелоЗапроса);

	Возврат Ответ;
КонецФункции

Функция updatedataprocessors(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	АктуализацияДопОбработок.ВключениеДопОбработокВОчередьНаАктуализацию(КоннекторHTTP.JsonВОбъект(ТелоЗапроса));
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти