#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(СтруктураПолей) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор();
	Запись.Обрабатывать = Истина;
	Запись.ОписаниеОшибки = "";
	Запись.ДатаПоследнейОбработки = Дата(1,1,1);
	Запись.ДатаЗаписи = ТекущаяДата();
	
	ЗаполнитьЗначенияСвойств(Запись, СтруктураПолей);
	
	Запись.Записать(Истина);

КонецПроцедуры

Процедура ОбновитьЗапись(ИдентификаторЗаписи, СтруктураПолей) Экспорт
	
	Набор = РегистрыСведений.ОчередьАктуализацииДопОбработок.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи);

	СтрокаНабора = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора, СтруктураПолей);

	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
