#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогРепозиториевПроектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогРепозиториевПроекта;  
	ДиалогОткрытия.Заголовок = "Выберите каталог репозиториев проекта"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаРепозиториев_Завершение", ЭтотОбъект, "" ));
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогСборкиРелизаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогРепозиториевПроекта;  
	ДиалогОткрытия.Заголовок = "Выберите каталог сборки релизов"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаСборкиРелизов_Завершение", ЭтотОбъект, "" ));
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КаталогРепозиториевШараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогРепозиториевПроекта;  
	ДиалогОткрытия.Заголовок = "Выберите каталог сборки релизов на шаре"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаРепозиториевШара_Завершение", ЭтотОбъект, "" ));
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКаталогаРепозиториев_Завершение(Результат, Параметр) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогРепозиториевПроекта = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаСборкиРелизов_Завершение(Результат, Параметр) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогСборкиРелиза = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаРепозиториевШара_Завершение(Результат, Параметр) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогРепозиториевШара = Результат[0];
	
КонецПроцедуры

#КонецОбласти

