// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписиПоЗадачамРелиза(Релиз, ЗадачаРелиза, НетЗадачиВГит, НетЗадачиВБитрикс) Экспорт
	
	ДанныеЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаРелиза, "Ответственный, Постановщик");
	
	НаборЗаписей = РегистрыСведений.ЗадачиРелиза.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Релиз.Установить(Релиз);
	НаборЗаписей.Отбор.Задача.Установить(ЗадачаРелиза);
	НаборЗаписей.Отбор.Ответственный.Установить(ДанныеЗадачи.Ответственный);
	НаборЗаписей.Отбор.Постановщик.Установить(ДанныеЗадачи.Постановщик);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Задача = ЗадачаРелиза;
		Запись.Ответственный = ДанныеЗадачи.Ответственный;
		Запись.Постановщик = ДанныеЗадачи.Постановщик;
		Запись.Релиз = Релиз;
	Иначе
		Запись = НаборЗаписей[0];
		Запись.НетЗадачиВГит = НетЗадачиВГит;
		Запись.НетЗадачиВБитрикс = НетЗадачиВБитрикс;
	КонецЕсли;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
