// @strict-types


#Область ПрограммныйИнтерфейс

Процедура ОбновитьДанныеЗадач() Экспорт
	
	ТаблицаЗадач = Справочники.Задачи.НеЗакрытыеЗадачи();
	ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач);
	
КонецПроцедуры

Процедура ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач) Экспорт
	
КонецПроцедуры

Функция СтруктурированныеДанныеПоЗадаче(НомерЗадачи, ТаскТрекер = Неопределено) Экспорт
	
	ДанныеЗаполнения = Справочники.Задачи.НовыйДанныеЗадачи();
	ДанныеЗаполнения.Наименование = НомерЗадачи;
	ДанныеЗаполнения.Владелец = Справочники.Проекты.НайтиПоНаименованию("CBL");
	ДанныеЗаполнения.НомерЗадачи = НомерЗадачи;
	ДанныеЗаполнения.ИмяВетки = НомерЗадачи;

	Возврат ДанныеЗаполнения;
	
КонецФункции

#КонецОбласти
