// @strict-types

&НаКлиенте
Перем ОбъектВК, ОписаниеОшибки, Текст экспорт;

&НаКлиенте
Процедура ПодключитьВК(Команда)
	Подключить(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключить(УстановитьЕслиНеПодключено) Экспорт
	
	НачатьПодключениеВнешнейКомпоненты(
		Новый ОписаниеОповещения("ПослеПодключения", ЭтотОбъект, УстановитьЕслиНеПодключено),
		"ОбщийМакет.RDPClient_Макет","MyVK"
		,AddInType.Native
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключения(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если Подключено Тогда
		Если ОбъектВК = Неопределено Тогда	
			ОбъектВК = Новый("AddIn.MyVK.RDPClientNativeAPI1C");
		КонецЕсли;
	ИначеЕсли УстановитьЕслиНеПодключено Тогда
		НачатьУстановкуВнешнейКомпоненты(
			Новый ОписаниеОповещения(
			"Подключить",
			ЭтотОбъект,
			Ложь),
			"ОбщийМакет.RDPClient_Макет"
		);
	Иначе
		Сообщить("Не удалось подключить внешнюю компоненту.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Кодировать(Команда)
	Текст = Пароль;
	Попытка
		ОбъектВК.Кодировать(Текст);
		Объект.ШифрПароля = Текст;
	Исключение
		ОбъектВК.ПолучитьОшибку(ОписаниеОшибки);
		Сообщить(ОписаниеОшибки);
	КонецПопытки;
	Текст = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ОбъектВК = Неопределено Тогда	
		ОбъектВК = Новый("AddIn.MyVK.RDPClientNativeAPI1C");
	КонецЕсли;
	Текст = Пароль;
	Кодировать(Объект);	
	Текст = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОбъектВК = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяРазделить()
	Если СтрНайти(Объект.Наименование,"\")>0 Тогда
		стр = СтрРазделить(Объект.Наименование,"\",Ложь);	
		Объект.Наименование = стр[1];
		Объект.ДоменПользователя = стр[0];
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяПриИзменении(Элемент)
	ИмяПользователяРазделить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗаполнятьПараметры") Тогда
		Объект.ДоменПользователя = Параметры.Домен;
		Объект.Наименование = Параметры.Логин;
		Объект.Сервер = Параметры.Клиент;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ИмяПользователяРазделить();
КонецПроцедуры
