// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс


Процедура ЗагрузитьДанные() Экспорт

	ДанныеПоСпринтам();
	ЗагрузитьДанныеПоЗадачам();

КонецПроцедуры


Процедура ЗагрузитьДанныеПоЗадачам() Экспорт
	
	Задачи.Загрузить(Справочники.Задачи.ЗадачиПоСпринтам(Ответственные, Спринты.ВыгрузитьЗначения()));
	ТекущийСпринт = Неопределено;
	Для Каждого СтрокаЗадачи Из Задачи Цикл
		//СтрокаЗадачи.ПлановоеВремя = СтрокаЗадачи.ПлановоеВремя - СтрокаЗадачи.ЗатраченноеВремя;
		Если СтрокаЗадачи.Спринт <> ТекущийСпринт Тогда
			Индекс = 0;
			ТекущийСпринт = СтрокаЗадачи.Спринт;
		КонецЕсли;
		Индекс = Индекс + 1;
		СтрокаЗадачи.Порядок = Индекс;
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеПоСпринтам() Экспорт
	
	Спринты.ЗагрузитьЗначения(Справочники.Спринты.ДанныеПоСпринтам(Период).ВыгрузитьКолонку("Ссылка"));

КонецФункции

#КонецОбласти

#Область Инициализация

//ЗагрузитьДанные();

#КонецОбласти

#КонецЕсли