// @strict-types


#Область ПрограммныйИнтерфейс

Функция ПолучитьОписаниеОбъектаМетаданныхПоИмениФайл(Файл) Экспорт	
	
	Возврат РаботаСОбъектами.ПолучитьОписаниеОбъектаМетаданныхПоИмениФайл(Файл);
	
КонецФункции

Процедура ДобавитьНомерВерсииОбработкамЗадачи(Задача, Ответстенный, Комментарий) Экспорт
	
	РаботаСОбъектами.ДобавитьНомерВерсииОбработкамЗадачи(Задача, Ответстенный, Комментарий);
	
КонецПроцедуры

Процедура ФорматироватьСписокОбновляемыхОбработок(СписокОбновляемыхОбработок) Экспорт
	
	РаботаСОбъектами.ФорматироватьСписокОбновляемыхОбработок(СписокОбновляемыхОбработок);
	
КонецПроцедуры

#КонецОбласти

