// @strict-types

#Область ПрограммныйИнтерфейс

Процедура ЗапускПриложения(ПараметрыЗапускаПрограммы) Экспорт

	ЗаписьЖурналаРегистрации("GIT",,,, ПараметрыЗапускаПрограммы.СтрокаКоманды);

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыЗапускаПрограммы);
	ФоновыеЗадания.Выполнить("ЗапускПриложенийЧерезShell.ЗапускПриложенияВФоне", МассивПараметров);

КонецПроцедуры

Процедура ЗапускПриложенияВФоне(ПараметрыЗапускаПрограммы) Экспорт
	
	ЭкземплярФоновогоЗадания = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	СтрокаКоманды = ПараметрыЗапускаПрограммы.СтрокаКоманды;
	ТекущийКаталог	= ПараметрыЗапускаПрограммы.ТекущийКаталог;
	
	ТаймаутВыполненияКомандыСек = 60;
	
	ВременныйФайлСкрипта = ПолучитьИмяВременногоФайла("bat");
	ЗаписьТекстаСкрипта = Новый ТекстовыйДокумент;
	ЗаписьТекстаСкрипта.УстановитьТекст(СтрокаКоманды);
	ЗаписьТекстаСкрипта.Записать(ВременныйФайлСкрипта, "cp866");		
	
	КомандаЗавершенаПоТаймауту = Ложь;
	ВыводИнформация = "";
	ВыводОшибки = "";

	ТекстСкриптаДляВыполнения = ВременныйФайлСкрипта;
	НачалоВыполненияКоманды = ТекущаяДата();
	ЗавершениеВыполненияКоманды = НачалоВыполненияКоманды + ТаймаутВыполненияКомандыСек;
	
	Попытка		
		objShell = Новый COMОбъект("WScript.Shell");
	Исключение		
		Ошибка = "Не удалось инициализировать WScript.Shell.
		|Подробнее:
		|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
		
		ВызватьИсключение Ошибка;
				
	КонецПопытки;
	objShell.CurrentDirectory = ТекущийКаталог;
	
	objWshScriptExec = objShell.Exec(ТекстСкриптаДляВыполнения);
	objStdOut = objWshScriptExec.StdOut;
	objStdErr = objWshScriptExec.StdErr;
	
	ВыводИнформация = СтрокаКоманды;
	Номер = 1;
	Если НЕ КомандаЗавершенаПоТаймауту Тогда	
		Пока Не objWshScriptExec.Status = 1 Цикл		
			Пока Не objStdOut.AtEndOfStream Цикл			
				Номер = Номер + 1;

				//Информация
				strLine = objStdOut.ReadLine();
				strLine = ПреобразоватьКодировку(strLine);
				ВыводИнформация = ВыводИнформация 
				+ strLine 
				+ Символы.ВК 
				+ Символы.ПС;
				
				Если ЭкземплярФоновогоЗадания <> Неопределено Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ВыводИнформация;
					Сообщение.Сообщить();
				КонецЕсли;
				
				Если ЗавершениеВыполненияКоманды <= ТекущаяДата() Тогда				
					КомандаЗавершенаПоТаймауту = Истина;
					Прервать;				
				КонецЕсли;
				
			КонецЦикла;
			
			Прервать;				
			
		КонецЦикла; 		
	КонецЕсли;
	
	// "Насильно" завершаем процесс по завершению работы
	// и "уничтожаем" COM-объект
	Попытка		
		objWshScriptExec.Terminate();
		objWshScriptExec = Неопределено;
		
		ЗаписьЖурналаРегистрации("GIT",,,, "Работа ");

	Исключение		
		objWshScriptExec = Неопределено;
		ЗаписьЖурналаРегистрации("GIT",,,, "Попали в исключение");

	КонецПопытки;	
	objShell = Неопределено;
	Если КомандаЗавершенаПоТаймауту Тогда
		ВыводОшибки	= "Внимание! Выполнение остановлено по истечении времени ожидания.";
	КонецЕсли;
	
	Если ЭкземплярФоновогоЗадания <> Неопределено Тогда
	 	Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ВыводИнформация;
		Сообщение.Сообщить();
	КонецЕсли;

	УдалитьФайлЕслиВозможно(ВременныйФайлСкрипта);
	
КонецПроцедуры

Процедура ПолучитьВывод(ПараметрыЗапускаПрограммы) Экспорт
	
	ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере = ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВывода;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПреобразоватьКодировку(Текст, ИсходнаяКодировка = "windows-1251", НоваяКодировка = "cp866")
	
	ВременныйФайлИсходный = ПолучитьИмяВременногоФайла();
	
	ЗаписьТекстаИсходный = Новый ТекстовыйДокумент;
	ЗаписьТекстаИсходный.УстановитьТекст(Текст);
	ЗаписьТекстаИсходный.Записать(ВременныйФайлИсходный, ИсходнаяКодировка);
	
	ЧтениеТекстаНовый = Новый ТекстовыйДокумент;
	ЧтениеТекстаНовый.Прочитать(ВременныйФайлИсходный, НоваяКодировка); 
	КонвертированныйТекст = ЧтениеТекстаНовый.ПолучитьТекст();
	
	УдалитьФайлЕслиВозможно(ВременныйФайлИсходный);
	
	Возврат КонвертированныйТекст;	
	
КонецФункции

Функция УдалитьФайлЕслиВозможно(ПутьКФайлу)
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Попытка
		
		УдалитьФайлы(ПутьКФайлу);
		Возврат Истина;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
		
КонецФункции

#КонецОбласти
