#Область ПрограммныйИнтерфейс

Функция СсылкаAllure(URLJenkins, ИмяJobJenkins, НомерJob) Экспорт
	
	Возврат СтрШаблон("%1/job/%2/%3/allure",
			URLJenkins,
			ИмяJobJenkins,
			НомерJob);
			
КонецФункции

Процедура ОбработатьСборки() Экспорт
	
	//todo описание структуры
	Пайплайны = РегистрыСведений.Пайплайны.АктивныеПайплайны();
	
	Для Каждого Пайплайн Из Пайплайны Цикл
		Если Пайплайн.Статус = Перечисления.СтатусыПайплайнов.Новый Тогда
			ЗапуститьПайплайн(Пайплайн);
		ИначеЕсли Пайплайн.Статус = Перечисления.СтатусыПайплайнов.ДобавленВОчередь Тогда
			ПроверитьСтартПайплайна(Пайплайн);
		ИначеЕсли Пайплайн.Статус = Перечисления.СтатусыПайплайнов.Выполняется Тогда
			ПроверитьВыполнениеПайплайна(Пайплайн);
		ИначеЕсли Пайплайн.Статус = Перечисления.СтатусыПайплайнов.Выполнено Тогда
			ПрочитатьОтчетПайплайна(Пайплайн);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапуститьПайплайн(Пайплайн)

	ЗапускПриложенияЧерезJENKINS.ЗапускПриложенияПоЗадаче(Пайплайн);
	
КонецПроцедуры

Процедура ПроверитьВыполнениеПайплайна(Пайплайн)
	
	ЗапускПриложенияЧерезJENKINS.ПолучитьВыводПоСборке(Пайплайн);
	
КонецПроцедуры

Процедура ПроверитьСтартПайплайна(Пайплайн)
	
	ЗапускПриложенияЧерезJENKINS.ПроверитьСтартПайплайна(Пайплайн);
	
КонецПроцедуры

Процедура ПрочитатьОтчетПайплайна(Пайплайн)
	
	ЗапускПриложенияЧерезJENKINS.ПрочитатьОтчетПайплайнаAllure(Пайплайн);
	
КонецПроцедуры

#КонецОбласти