#Область ПрограммныйИнтерфейс

Функция МенеджерТаскТрекера(ТипТаскТрекера) Экспорт
	
	МенеджерТаскТрекера = Неопределено;
	
	Если ТипТаскТрекера = Bitrix Тогда
		МенеджерТаскТрекера = РаботаСBitrix;
	ИначеЕсли ТипТаскТрекера = Предприятие1С Тогда
		МенеджерТаскТрекера = РаботаСПредприятие1С;
	ИначеЕсли ТипТаскТрекера = Отсутствует Тогда
		МенеджерТаскТрекера = РаботаБезТаскТрекера;
	Иначе
		ВызватьИсключение НСтр("ru = 'Невалидный формат работы Таск трекеров'");
	КонецЕсли;
	
	Возврат МенеджерТаскТрекера;
	
КонецФункции

#КонецОбласти