// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(ДанныеЗаполнения) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(ДанныеЗаполнения);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьЗапись(ДанныеЗаполнения) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(ДанныеЗаполнения);
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

Функция ОбъектыРазработкиПоБазе(База) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеестрОбъектовРазработкиИсключенияНаРеализацию.ОбъектРазработки КАК ОбъектРазработки
	               |ИЗ
	               |	РегистрСведений.РеестрОбъектовРазработкиИсключенияНаРеализацию КАК РеестрОбъектовРазработкиИсключенияНаРеализацию
	               |ГДЕ
	               |	РеестрОбъектовРазработкиИсключенияНаРеализацию.База = &База";
	
	Запрос.УстановитьПараметр("База", База);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектРазработки");
	
КонецФункции

Функция НовыйДанныеЗаполнения() Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("База", Справочники.Базы.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ОбъектРазработки", Справочники.ОбъектыРазработки.ПустаяСсылка());
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецЕсли