
Процедура ПодключитьсяКRDP(Сервер) Экспорт
	
	Попытка
		НачатьУстановкуВнешнейКомпоненты(
			Новый ОписаниеОповещения(
			"Подключить",
			ЭтотОбъект,
			Сервер),
			"ОбщийМакет.RDPClient_Макет"
		);
	Исключение
		Подключить(Сервер);
	КонецПопытки;

КонецПроцедуры

Процедура Подключить(Сервер) Экспорт
	
	НачатьПодключениеВнешнейКомпоненты(
		Новый ОписаниеОповещения("ПослеПодключения", ЭтотОбъект, Сервер),
		"ОбщийМакет.RDPClient_Макет","MyVK"
		,AddInType.Native
	);
	
КонецПроцедуры

Процедура ПослеПодключения(Подключено, Сервер) Экспорт
	
	Если Подключено Тогда
		ОбъектВК = Новый("AddIn.MyVK.RDPClientNativeAPI1C");
	Иначе
		Сообщить("Не удалось подключить внешнюю компоненту.");
		Возврат;
	КонецЕсли;
	
	УчетныеДаннные = УчетныеДаннные(Сервер);
	//Сообщить("Сервер: "+СерверАдрес+", Домен: "+Домен+", Имя Пользователя: "+ Логин+
	//	", Шифр: "+Шифр+
	//	", Шлюз: "+Шлюз+
	//	", Набор: "+Набор);
	
	Попытка
		ОбъектВК.ПодключитьУРС(УчетныеДаннные.Адрес,
			УчетныеДаннные.Домен, УчетныеДаннные.Логин, УчетныеДаннные.Шифр,
			"", ""
		);
	Исключение
		ОписаниеОшибки = "";
		ОбъектВК.ПолучитьОшибку(ОписаниеОшибки);
		Сообщить(ОписаниеОшибки);
	КонецПопытки;

КонецПроцедуры

Функция УчетныеДаннные(Сервер) Экспорт
	
	ДанныеПоПодключению = РаботаСRDP.УчетныеДаннные(Сервер);
	Возврат ДанныеПоПодключению;
	
КонецФункции
