#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	

	База = ПараметрКоманды;
	ТекстСообщения = СтрШаблон("Вы уверены, что хотите актуализировать обработки в базе %1?", База);
	ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьОбработкиВБазеПослеВопроса", ЭтотОбъект, База);
	
	ПоказатьВопрос(ОбработчикОповещенияОЗакрытии, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Актуализация обработок базы'"));

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбработкиВБазеПослеВопроса(Результат, База) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыБазы  = НастройкиБазы(База);

	ПутьКПапкеВнешнихОбработок = КаталогСборкиПроект(ПараметрыБазы.Проект);
	
	КомандаЗапуска  = КомандыЗапускаПриложения.НовыйКомандаОбновлениеОбработкиИзПапки(ПараметрыБазы, ПутьКПапкеВнешнихОбработок);
	
	ЗапускПриложенияНаСервере(База, КомандаЗапуска);
	
КонецПроцедуры

&НаСервере
Процедура ЗапускПриложенияНаСервере(База, КомандаЗапуска)
	
	ПараметрыЗапуска = СтратегияЗапускаСкриптов.ПодготовкаПараметровИЗапускПриложения(База, КомандаЗапуска);
	ДанныеЛогов = СтратегияЗапускаСкриптов.ДанныеЛоговБезОжидания(ПараметрыЗапуска);
	
КонецПроцедуры

&НаСервере
Функция НастройкиБазы(База)
	
	Возврат РаботаСGitAPIПовтИсп.НастройкиБазы(База);
	
КонецФункции

&НаСервере
Функция КаталогСборкиПроект(Проект)

	Возврат Справочники.Проекты.ПутьКПапкеСборкиОбработок(Проект);
	
КонецФункции

#КонецОбласти
