#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Проект = Параметры.Проект;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БазаПриИзменении(Элемент)
	ОбновитьПроцессы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсеПроцессы(Команда)
	ПеренестиПроцессыВСекциюВыбранных(Процессы);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцесс(Команда)
	
	НовыеПроцессы = Новый СписокЗначений;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Процессы.ВыделенныеСтроки Цикл
		ВыделенныйПроцесс = Элементы.Процессы.ДанныеСтроки(ВыделеннаяСтрока);
		НовыеПроцессы.Добавить(ВыделенныйПроцесс.Значение, ВыделенныйПроцесс.Представление);	
	КонецЦикла;
	
	ПеренестиПроцессыВСекциюВыбранных(НовыеПроцессы);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыбранныеПроцессы(Команда)
	Закрыть(ВыбранныеПроцессы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПроцессы()
	ПроцессыПоБазе = Обработки.КомандыПроцессов.ПроцессыПоБазе(База);
	Процессы = ПроцессыПоБазе;	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиПроцессыВСекциюВыбранных(НовыеПроцессы)
	
	Для Каждого Процесс Из НовыеПроцессы Цикл
		
		Если ВыбранныеПроцессы.НайтиПоЗначению(Процесс.Значение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыбранныеПроцессы.Добавить(Процесс.Значение, Процесс.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти