// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОбновитьЗадачи(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗадачи(ЗадачиРазработки)
	
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	ТаблицаЗадач = Справочники.Задачи.НомераЗадачИСсылкиПоСписку(ЗадачиРазработки);
	Если ЗадачиРазработки.Количество() > 0 Тогда
	
		ТипТаскТрекера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачиРазработки[0], "Владелец.ТаскТрекер.ТипТаскТрекера" );
		МенеджерТаскТрекера = Перечисления.ТаскТрекеры.МенеджерТаскТрекера(ТипТаскТрекера);
				
		МенеджерТаскТрекера.ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач);
				
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти

