#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОбновитьЗадачиBitrix(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗадачиBitrix(ЗадачиРазработки)
	
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	ТаблицаЗадач = Справочники.Задачи.НомераЗадачИСсылкиПоСписку(ЗадачиРазработки);
	РаботаСBitrix.ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач);
	
КонецПроцедуры


#КонецОбласти

