// Функция - Соеденение СAPI
// 
// Возвращаемое значение:
//   - 
//
Функция СоеденениеСAPI() Экспорт

	Возврат РаботаСGitAPIПовтИсп.СоеденениеСAPI();
	
КонецФункции

// Функция - Отправить запрос КAPI
//
// Параметры:
//  АдресЗапроса	 - 	 - 
//  Заголовки		 - 	 - 
//  HttpСоединение	 - 	 - 
//  Метод			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ОтправитьЗапросКAPI(Знач АдресЗапроса,
	Знач HttpСоединение, Знач Метод = "GET") Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Запрос = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
	Если Метод = "GET" Тогда
		РезультатЗапроса = HttpСоединение.Получить(Запрос);
	КонецЕсли;

	Возврат РезультатЗапроса;
	
КонецФункции