// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДанныеПодключенияПоСерверу(Сервер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УчетныеДанныеRDP.Наименование КАК Наименование,
		|	УчетныеДанныеRDP.Сервер.Наименование КАК Сервер,
		|	УчетныеДанныеRDP.ШифрПароля КАК ШифрПароля,
		|	УчетныеДанныеRDP.ДоменПользователя КАК ДоменПользователя
		|ИЗ
		|	Справочник.УчетныеДанныеRDP КАК УчетныеДанныеRDP
		|ГДЕ
		|	УчетныеДанныеRDP.Владелец = &Пользователь
		|	И УчетныеДанныеRDP.Сервер = &Сервер";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Сервер", Сервер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#КонецЕсли
