#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПроцессыПоБазе(База) Экспорт
	
	НастройкаБазы = РаботаСGitAPIПовтИсп.НастройкиБазы(База);
	КаталогПроцессов = СтрШаблон("%1\feature", НастройкаБазы.КаталогБазыШара);
	
	НайденныеФайлы = НайтиФайлы(КаталогПроцессов, "*.");
	ИменаПроцессов = Новый СписокЗначений;
	
	Для Каждого Файл Из НайденныеФайлы Цикл
		ИменаПроцессов.Добавить(Файл.ПолноеИмя, Файл.Имя);
	КонецЦикла;
	
	Возврат ИменаПроцессов;
	
КонецФункции

#КонецОбласти

#КонецЕсли