#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НастройкиПроектов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Проекты.Ссылка КАК Ссылка,
	|	Проекты.URLGitLab КАК URLGitLab,
	|	Проекты.PathGitClone КАК PathGitClone,
	|	Проекты.ИДПроектаGitLab КАК ИДПроектаGitLab,
	|	Проекты.ПарольJenkins КАК ПарольJenkins,
	|	Проекты.ТокенJenkins КАК ТокенJenkins,
	|	Проекты.URLJenkins КАК URLJenkins,
	|	Проекты.ИмяJobJenkins КАК ИмяJobJenkins,
	|	Проекты.КаталогСборкиРелиза КАК КаталогСборкиРелиза,
	|	Проекты.КаталогРепозиториевШара КАК КаталогРепозиториевШара,
	|	Проекты.КаталогРепозиториевПроекта КАК КаталогРепозиториевПроекта,
	|	Проекты.БазаДляАктуализацииОбработок КАК БазаДляАктуализацииОбработок,
	|	Проекты.БазаДляАктуализацииОбработок.ИмяПользователяИнформационнойБазы КАК БазаДляАктуализацииОбработокИмяПользователяИнформационнойБазы,
	|	Проекты.БазаДляАктуализацииОбработок.ПарольПользователяИнформационнойБазы КАК БазаДляАктуализацииОбработокПарольПользователяИнформационнойБазы,
	|	Проекты.БазаДляАктуализацииОбработок.КластерСерверов.Наименование КАК БазаДляАктуализацииОбработокКластерСерверовНаименование,
	|	Проекты.БазаДляАктуализацииОбработок.ИмяИнформационнойБазы КАК БазаДляАктуализацииОбработокИмяИнформационнойБазы,
	|	Проекты.ПапкаАктуальныхОбработок КАК ПапкаАктуальныхОбработок,
	|	Проекты.ИмяПользователяJenkins КАК ИмяПользователяJenkins,
	|	Проекты.СтрокаРасширенийДляАктуализацииОбработок КАК СтрокаРасширенийДляАктуализацииОбработок
	|ИЗ
	|	Справочник.Проекты КАК Проекты";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НастройкиПроекта(Проект) Экспорт
	
	НастройкиПроектов = НастройкиПроектов();
	СтрокаПроекта = НастройкиПроектов.Найти(Проект, "Ссылка");
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаПроекта);
	
КонецФункции

Функция ПутьКПапкеСборкиОбработок(Проект) Экспорт

	КаталогСборкиРелиза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "КаталогСборкиРелиза");
	Возврат СтрШаблон("%1\%2", КаталогСборкиРелиза, ПапкаСборкиОбработок());
	
КонецФункции

Функция ПапкаСборкиОбработок()
	Возврат "develop";
КонецФункции

#КонецОбласти

#КонецЕсли

