
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СборкаРелиза(Команда)	
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	УстановитьСтраницуФормы("ГруппаСборкаРелиза");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеБазы(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	УстановитьСтраницуФормы("ОбновлениеБазы");

КонецПроцедуры

&НаКлиенте
Процедура ТочечноеОбновлениеВБЛ(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСтраницуФормы("ТочечноеОбновлениеВБЛ");
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияРелиза(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСтраницуФормы("РегистрацияРелиза");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьСтраницуФормы(ИмяСтраницы)
	
	Форма = ОткрытьФорму("Обработка.МенеджерРелизов.Форма.Форма",, ЭтаФорма, Истина);
	Форма.Элементы.ГруппаСтраниц.ТекущаяСтраница = Форма.Элементы[ИмяСтраницы];
	Форма.Элементы.ГруппаСтраниц.ТекущаяСтраница.Видимость = Истина;	
	
КонецПроцедуры

#КонецОбласти
