#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбновитьЗадачиBitrix(ПараметрКоманды);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗадачиBitrix(ЗадачиРазработки)
	
	
	Для Каждого Элемент Из ЗадачиРазработки Цикл
		Если ЗначениеЗаполнено(Элемент.НомерЗадачиБазовой) Тогда
			Попытка
				Справочники.Задачи.НоваяЗадача(Элемент.НомерЗадачиБазовой);
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

