// @strict-types

#Область ПрограммныйИнтерфейс

Процедура ЗапускПриложения(ПараметрыЗапускаПрограммы) Экспорт

	ЗаписьЖурналаРегистрации("GIT",,,, ПараметрыЗапускаПрограммы.СтрокаКоманды);
	
	ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВывода = 
			СтратегияЗапускаСкриптов.ИмяВременногоФайла(ПараметрыЗапускаПрограммы.ПутьКПапкеДевопс);
			
	Отладка = Ложь;
	Если Отладка Тогда
		ЗапускПриложенийЧерезCMD.ЗапускПриложенияВФоне(ПараметрыЗапускаПрограммы);
	Иначе
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПараметрыЗапускаПрограммы);
		ФоновыеЗадания.Выполнить("ЗапускПриложенийЧерезCMD.ЗапускПриложенияВФоне", МассивПараметров);
	КонецЕсли;

КонецПроцедуры

Процедура ЗапускПриложенияВФоне(ПараметрыЗапускаПрограммы) Экспорт
	
	СтрокаКоманды = ПараметрыЗапускаПрограммы.СтрокаКоманды;
	ТекущийКаталог = ПараметрыЗапускаПрограммы.ТекущийКаталог;
	ДождатьсяЗавершения = ПараметрыЗапускаПрограммы.ДождатьсяЗавершения;
	ПолучитьПотокВывода = ПараметрыЗапускаПрограммы.ПолучитьПотокВывода;
	ПолучитьПотокОшибок = ПараметрыЗапускаПрограммы.ПолучитьПотокОшибок;
	КодировкаПотоков = ПараметрыЗапускаПрограммы.КодировкаПотоков;
	ИмяФайлаПотокаВывода = ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВывода;
	ИмяФайлаПотокаОшибок = ПараметрыЗапускаПрограммы.ИмяФайлаПотокаОшибок;
	
	Если Не ЗначениеЗаполнено(ИмяФайлаПотокаВывода) Тогда
		ВызватьИсключение НСтр("ru='Не указан файл вывода логов'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяФайлаПотокаОшибок) Тогда
		ИмяФайлаПотокаОшибок = ПолучитьИмяВременногоФайла("stderr.tmp");
		ПараметрыЗапускаПрограммы.ИмяФайлаПотокаОшибок = ИмяФайлаПотокаОшибок;
	КонецЕсли;
	
	Если ДождатьсяЗавершения Тогда 
		Если ПолучитьПотокВывода Тогда 
			СтрокаКоманды = СтрокаКоманды + " > """ + ИмяФайлаПотокаВывода + """ 2>&1";
		КонецЕсли;
		
		//Если ПолучитьПотокОшибок Тогда 
		//	СтрокаКоманды = СтрокаКоманды + " 2>>""" + ИмяФайлаПотокаВывода + """";
		//КонецЕсли;
	КонецЕсли;
	
	Если КодировкаПотоков = Неопределено Тогда
		КодировкаПотоков = "CP866";
	КонецЕсли;
	
	КодировкаИсполнения = "CP866";
	
	КодВозврата = Неопределено;
	
	СтрокаКоманды = ОбщегоНазначенияСлужебныйКлиентСервер.СтрокаЗапускаКомандыWindows(
		СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения, КодировкаИсполнения);
	
	ЗапуститьПриложение(СтрокаКоманды,, ДождатьсяЗавершения, КодВозврата);
	ЗаписьЖурналаРегистрации("GIT",,,, СтрокаКоманды + " запущена");
	
	ПотокВывода = "";
	ПотокОшибок = "";
	
	Если ДождатьсяЗавершения Тогда 
		Если ПолучитьПотокВывода Тогда
			ТекстДляЗаписи = Новый ЗаписьТекста();
			ТекстДляЗаписи.Открыть(ИмяФайлаПотокаВывода, "cp866",,Истина);
			ТекстДляЗаписи.ЗаписатьСтроку("Запуск приложения завершен"); 
			ТекстДляЗаписи.Закрыть();
		КонецЕсли;
		//
		//Если ПолучитьПотокОшибок Тогда 
		//	ПотокОшибок = ПрочитатьФайлЕслиСуществует(ИмяФайлаПотокаОшибок, КодировкаПотоков);
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьВывод(ПараметрыЗапускаПрограммы) Экспорт
	
	ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВыводаНаСервере = ПараметрыЗапускаПрограммы.ИмяФайлаПотокаВывода;
	
КонецПроцедуры

Функция ПрочитатьФайлЕслиСуществует(Путь, Кодировка) Экспорт
	
	Результат = Неопределено;
	ФайлИнфо = Новый Файл(Путь);
	
	Если ФайлИнфо.Существует() Тогда 
		
		ЧтениеПотокаОшибок = Новый ЧтениеТекста(Путь, Кодировка);
		Результат = ЧтениеПотокаОшибок.Прочитать();
		ЧтениеПотокаОшибок.Закрыть();
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда 
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
