#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ПроектПоПродукту(ИДПродукта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродуктыКПроектам.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ПродуктыКПроектам КАК ПродуктыКПроектам
	|ГДЕ
	|	ПродуктыКПроектам.ИДПродукта = &ИДПродукта";
	
	Запрос.УстановитьПараметр("ИДПродукта", ИДПродукта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Проект;	
	КонецЕсли;
	
	Возврат Справочники.Проекты.Неопределен;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
