// @strict-types


&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	РезультатЗадачи = "";
	Обещание = ВвестиСтрокуАсинх(РезультатЗадачи, НСтр("ru = 'Введите результат работы'"));
	РезультатЗадачи = Ждать Обещание;
	
	Если Не ЗначениеЗаполнено(РезультатЗадачи) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не введен результат!'"));
		Возврат;
	КонецЕсли;
	ДобавитьРезультатНаСервере(РезультатЗадачи, ПараметрКоманды);


КонецПроцедуры

&НаСервере
Процедура ДобавитьРезультатНаСервере(РезультатЗадачи, СписокЗадач)
	
	Для Каждого Элемент Из СписокЗадач Цикл
		
		РаботаСBitrix.ДобавитьРезультатЗадачи(РезультатЗадачи, Элемент.НомерЗадачи);
		
	КонецЦикла;
	
	
КонецПроцедуры