#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтадияПоКодуBitrix(Идентификатор) Экспорт
	
	Результат = Справочники.СтадииКанбан.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтадииКанбан.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКанбан КАК СтадииКанбан
		|ГДЕ
		|	СтадииКанбан.КодBitrix = &КодBitrix";
	Запрос.УстановитьПараметр("КодBitrix", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		НовыйЭлемент = Справочники.СтадииКанбан.СоздатьЭлемент();
		НовыйЭлемент.Заполнить(Неопределено);
		НовыйЭлемент.Наименование = "Неопределено";
		НовыйЭлемент.УстановитьНовыйКод();
		НовыйЭлемент.КодBitrix = Идентификатор;
		Если Не НовыйЭлемент.ПроверитьЗаполнение() Тогда
			ВызватьИсключение(НСтр("ru='Ошибка проверки записи справочника'"));	
		КонецЕсли;
		НовыйЭлемент.Записать();
		Результат = НовыйЭлемент.Ссылка;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
