#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СобратьРелиз() Экспорт
		
	
КонецПроцедуры

Процедура ОбновитьОбработкиВРБД(Знач СписокБазНаОбновление, Знач СписокОбновляемыхОбработок) Экспорт
		
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограмныйИнтерфейс

Процедура ФорматироватьСписокБазВКоманднуюСтроку(СписокБазНаОбновление) Экспорт
	
	ДанныеБаз = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокБазНаОбновление, 
		"КластерСерверов.Наименование, ИмяИнформационнойБазы, ИмяПользователяИнформационнойБазы, ПарольПользователяИнформационнойБазы");
	
	ШаблонСтроки = "%1$%2$%3$%4";

	МассивСтрокБаз = Новый Массив;
	Для Каждого ОбновляемаяБаза Из ДанныеБаз Цикл
		СтрокаБазы = СтрШаблон(ШаблонСтроки, 
			ОбновляемаяБаза.Значение.КластерСерверов,
			ОбновляемаяБаза.Значение.ИмяИнформационнойБазы,
			ОбновляемаяБаза.Значение.ИмяПользователяИнформационнойБазы,
			ОбновляемаяБаза.Значение.ПарольПользователяИнформационнойБазы);
			
		 МассивСтрокБаз.Добавить(СтрокаБазы);
	КонецЦикла;
	
	СписокБазНаОбновление = СтрСоединить(МассивСтрокБаз, ",");
	
КонецПроцедуры

Процедура ФорматироватьСписокОбновляемыхОбработок(СписокОбновляемыхОбработок) Экспорт
	
	СписокОбновляемыхОбработок = СтрСоединить(СписокОбновляемыхОбработок, ",");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли