#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция МаксимальнаяДатаОбработки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNULL(МАКСИМУМ(ЗафиксированныеОбработки.ДатаФиксации), ДАТАВРЕМЯ(1, 1, 1) КАК ДатаФиксации
		|ИЗ
		|	РегистрСведений.ЗафиксированныеОбработки КАК ЗафиксированныеОбработки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДатаФиксации;
	
КонецФункции

#КонецОбласти

#КонецЕсли
