// @strict-types


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОбъектыРазработки(Команда)
	
	ЗаполнитьОбъектыРазработкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОбъектыРазработкиНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");	
	ДокументОбъект.ЗаполнитьОбъектыРазработкиВТабличнойЧасти();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРазработкиПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборСпискаВерсии", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСпискаВерсии()

	ТекущиеДанные = Элементы.ОбъектыРазработки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
 		Возврат;
	КонецЕсли;
	УстановитьОтборПоКлючу(ТекущиеДанные, Элементы.Версии);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКлючу(ТекущиеДанные, ТекЭлем)

	Отбор = Новый Структура;
	Отбор.Вставить("Название", ТекущиеДанные.Название);

	ТекЭлем.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаСервере
Процедура ВнестиВерсииНаСервере()	
	РаботаСВерсиямиОбработок.ИзменитьВерсииПоРелизу(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВнестиВерсии(Команда)
	ВнестиВерсииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектыРазработкиНаСервере()

	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	ОбъектДокумента.СоздатьНедостающиеОбъекты();
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъектыРазработки(Команда)
	СоздатьОбъектыРазработкиНаСервере();
КонецПроцедуры

#КонецОбласти

