// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ОбъектыРазработкиПоследнихРелизов(Проект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РелизыСрезПоследних.Проект КАК Проект,
	|	РелизыСрезПоследних.ОбъектРазработки КАК ОбъектРазработки,
	|	РелизыСрезПоследних.ВерсияОбъектаРазработки КАК ВерсияОбъектаРазработки
	|ИЗ
	|	РегистрСведений.Релизы.СрезПоследних(, Проект = &Проект) КАК РелизыСрезПоследних";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
	
#КонецЕсли