// @strict-types


#Область ПрограммныйИнтерфейс

Процедура ОбновитьДанныеЗадач() Экспорт
	
	ТаблицаЗадач = Справочники.Задачи.НеЗакрытыеЗадачи();
	ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач);
	
КонецПроцедуры

Процедура ОбновитьДанныеЗадачПоТаблице(ТаблицаЗадач) Экспорт
	
КонецПроцедуры

Функция СтруктурированныеДанныеПоЗадаче(НомерЗадачи, ТаскТрекер = Неопределено, Проект = Неопределено) Экспорт
	
	ДанныеЗаполнения = Справочники.Задачи.НовыйДанныеЗадачи();
	ИнформацияОЗадаче = ДанныеЗадачиЖира(НомерЗадачи, ТаскТрекер);
	
	Если ИнформацияОЗадаче["errorMessages"] <> Неопределено Тогда
		ВызватьИсключение(ИнформацияОЗадаче["errorMessages"][0]);
	КонецЕсли;

	Задача = ИнформацияОЗадаче["issues"][0];
	
	ДанныеЗаполнения.Наименование = Задача["fields"]["summary"];
	ДанныеЗаполнения.ПодробноеОписание = Задача["fields"]["description"];
	
	Ответственный = НайтиСоздатьПользователя(Задача["fields"]["assignee"]["displayName"], Неопределено);
	ДанныеЗаполнения.Ответственный = Ответственный;
	
	Постановщик = НайтиСоздатьПользователя(Задача["fields"]["creator"]["displayName"], Неопределено);
	ДанныеЗаполнения.Постановщик = Постановщик;
	
	СоответствиеСтатусов = СоответствиеСтатусов();
	Статус = СоответствиеСтатусов.Получить(Задача["fields"]["status"]);
	Если Статус = Неопределено Тогда
		Статус = Перечисления.СтатусыЗадач.Новая;
	КонецЕсли;
	
	ДанныеЗаполнения.Статус = Статус;
	ДанныеЗаполнения.СтатусЗадачи = Статус;
	ДанныеЗаполнения.ДатаСоздания = ПрочитатьДатуJSON(Задача["fields"]["created"], ФорматДатыJSON.ISO);
	ДанныеЗаполнения.НомерЗадачи = НомерЗадачи;
	ДанныеЗаполнения.ИмяВетки = НомерЗадачи;

	ДанныеЗаполнения.Владелец = Проект; // todo Определять по проекту из Жиры

	Возврат ДанныеЗаполнения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеЗадачиЖира(НомерЗадачи, ТаскТрекер)
	
	РеквизитыТаскТрекера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТаскТрекер, "URL, Логин");
	УстановитьПривилегированныйРежим(Истина);
	СекретныеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ТаскТрекер, "Токен, Пароль" );
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("jql", СтрШаблон("key=%1", НомерЗадачи));
	
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Аутентификация = Новый Структура;
	ДополнительныеПараметры.Аутентификация.Вставить("Пользователь", РеквизитыТаскТрекера.Логин);
	ДополнительныеПараметры.Аутентификация.Вставить("Пароль", СекретныеДанные.Токен);
	
	ДанныеЗапроса = КоннекторHTTP.GetJson(СтрШаблон("%1/rest/api/2/search", РеквизитыТаскТрекера.URL), ПараметрыЗапроса, ДополнительныеПараметры);
	
	Возврат ДанныеЗапроса;	
	
КонецФункции

Функция НайтиСоздатьПользователя(ИмяПользователя, IDПользователя)
	
	// todo Сделать привязку по Идентификатору
	
	УстановитьПривилегированныйРежим(Истина);

	ТекПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя, Истина);
	ПользовательСуществует = ЗначениеЗаполнено(ТекПользователь);
	
	Если НЕ ПользовательСуществует Тогда
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		Пользователь.Наименование = ИмяПользователя;
		Пользователь.Записать();
		ТекПользователь = Пользователь.Ссылка;
	КонецЕсли;
	
	Возврат ТекПользователь;
	
КонецФункции

Функция СоответствиеСтатусов()
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("К выполнению", Перечисления.СтатусыЗадач.Новая);
	СоответствиеСтатусов.Вставить("В работе", Перечисления.СтатусыЗадач.Выполняется);
	СоответствиеСтатусов.Вставить("Ожидает тестирования", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("Тестирование", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("ФИЧА-РЕВЬЮ", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("КОД_РЕВЬЮ", Перечисления.СтатусыЗадач.ЖдетКонтроля);
	СоответствиеСтатусов.Вставить("Ожидает помещения", Перечисления.СтатусыЗадач.ЖдетВыполнения);
	СоответствиеСтатусов.Вставить("Ожидает обновления", Перечисления.СтатусыЗадач.ЖдетВыполнения);
	СоответствиеСтатусов.Вставить("У инициатора", Перечисления.СтатусыЗадач.ЖдетВыполнения);
	СоответствиеСтатусов.Вставить("ГОТОВО", Перечисления.СтатусыЗадач.Завершена);
	СоответствиеСтатусов.Вставить("Won't Do", Перечисления.СтатусыЗадач.Завершена);

	Возврат СоответствиеСтатусов;
	
КонецФункции

#КонецОбласти
