
&НаКлиенте
Процедура ВыполнитьКлиент(Команда)

  ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
  ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
  ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
  ПараметрыЗапускаПрограммы.ПолучитьПотокОшибок = Истина;
  ПараметрыЗапускаПрограммы.Оповещение = Новый ОписаниеОповещения("ПриПолученииРезультатаЗапускаПрограммы", ЭтотОбъект);

  ФайловаяСистемаКлиент.ЗапуститьПрограмму(КомандаЗапуска, ПараметрыЗапускаПрограммы);

КонецПроцедуры

&НаКлиенте
Процедура ПриПолученииРезультатаЗапускаПрограммы(Результат, ДополнительныеПараметры) Экспорт
	КодВозврата = Результат.КодВозврата;
	ПотокВывода = Результат.ПотокВывода;
	ПотокОшибок = Результат.ПотокОшибок;
	Вывод = ПотокВывода + Символы.ПС + ПотокОшибок;
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьСерверНаСервере()
	
	ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокОшибок = Истина;
	Результат = ФайловаяСистема.ЗапуститьПрограмму(КомандаЗапуска, ПараметрыЗапускаПрограммы);
	
	ПотокВывода = Результат.ПотокВывода;
	ПотокОшибок = Результат.ПотокОшибок;
	Вывод = ПотокВывода + Символы.ПС + ПотокОшибок;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСервер(Команда)
	Команды.Вставить(0, КомандаЗапуска, КомандаЗапуска, , );
	ВыполнитьСерверНаСервере();
КонецПроцедуры
