#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗадачу(НомерЗадачи) Экспорт 
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.НомерЗадачи = НомерЗадачи;
	Запись.Записать();

КонецПроцедуры 

Процедура УдалитьЗадачу(НомерЗадачи) Экспорт

	Запись = СоздатьМенеджерЗаписи();
	Запись.НомерЗадачи = НомерЗадачи;
	Запись.Удалить();
	
КонецПроцедуры 

Функция СписокЗадачКЗагрузке() Экспорт

	НомераЗадач = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиКЗагрузке.НомерЗадачи КАК НомерЗадачи
		|ИЗ
		|	РегистрСведений.ЗадачиКЗагрузке КАК ЗадачиКЗагрузке";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НомераЗадач = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НомерЗадачи");
	
	Возврат НомераЗадач;
	
КонецФункции

Функция СписокЗадачКЗагрузкеСОсновными() Экспорт

	НомераЗадач = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиКЗагрузке.НомерЗадачи КАК НомерЗадачи,
		|	ЕСТЬNULL(Задачи.Ссылка, ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)) КАК Задача
		|ИЗ
		|	РегистрСведений.ЗадачиКЗагрузке КАК ЗадачиКЗагрузке
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Задачи КАК Задачи
		|		ПО ЗадачиКЗагрузке.НомерЗадачи = Задачи.НомерЗадачиБазовой";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НомераЗадач = РезультатЗапроса.Выгрузить();
	
	Возврат НомераЗадач;
	
КонецФункции

#КонецОбласти

#КонецЕсли
