// @strict-types

// Процедура - Выгрузить файл внешней обработки ВXML
//
// Параметры:
//  ПроектEPF	 - 	 - 
//
Процедура ВыгрузитьФайлВнешнейОбработкиВXML(Знач ПроектEPF, Знач ПутьВыгрузки) Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("log");
	ДополнениеПодключенияХранилища = "";
	Если ЗначениеЗаполнено(ПроектEPF.Владелец.АдресХранилища) Тогда
		ДополнениеПодключенияХранилища = СтрШаблон(
			"/ConfigurationRepositoryF ""%1"" /ConfigurationRepositoryN ""%2"" /ConfigurationRepositoryP ""%3""",
			ПроектEPF.Владелец.АдресХранилища, ПроектEPF.Владелец.ИмяПользователяХранилища, ПроектEPF.Владелец.ПарольПользователяХранилища);
	КонецЕсли;
	СтрокаЗапуска = СтрШаблон(
		"%1\1cv8.exe DESIGNER /DisableStartupDialogs /DisableStartupMessages /S ""%4\%5"" /N""%6"" /P""%7"" %8 /DumpExternalDataProcessorOrReportToFiles ""%2"" ""%3"" /Out ""%9""",
		Константы.ПутьКПапкеИсполняемыхФайлов1С.Получить(),
		ПутьВыгрузки,
		СтрШаблон("%1\%2\%3",
			РаботаСGit.ПутьККаталогуРепозитория(ПроектEPF.Владелец.ИмяПроектаНаGitLab),
			РаботаСGit.ИмяФайлаБезРасширения(ПроектEPF.Ссылка.ИмяФайла),
			ПроектEPF.Ссылка.ИмяФайла),
		ПроектEPF.Владелец.ИмяСервераКластера1С,
		ПроектEPF.Владелец.ИмяИнформационнойБазы,
		ПроектEPF.Владелец.ИмяПользователя,
		ПроектEPF.Владелец.ПарольПользователя,
		ДополнениеПодключенияХранилища,
		ИмяФайлаЛога);
	ЗапуститьПриложение(СтрокаЗапуска,,Истина);
	//Сообщить(СтрокаЗапуска);
	ДанныеВыводаПриложения = "";
	Попытка
		ЧтенияТекста = Новый ЧтениеТекста(ИмяФайлаЛога);
		ДанныеВыводаПриложения = ЧтенияТекста.Прочитать();
		ЧтенияТекста.Закрыть();
	Исключение
		// без обработки, значит не запустилось приложение
	КонецПопытки;
		
	ФайлEPF = Новый Файл(СтрШаблон("%1\%2\%3.xml", 
		РаботаСGit.ПутьККаталогуРепозитория(ПроектEPF.Владелец.ИмяПроектаНаGitLab), 
		РаботаСGit.ИмяФайлаБезРасширения(ПроектEPF.Ссылка.ИмяФайла),
		ПроектEPF.ИмяОбъекта));
	Если Не ФайлEPF.Существует() Тогда
		ВызватьИсключение СтрШаблон("Ошибка формирования файлов проекта, попробуйте повторить запрос позже.
		|
		|Данные для анализа:
		|%1", ДанныеВыводаПриложения);
	КонецЕсли;
	
КонецПроцедуры
	
// Функция - Сформировать файл внешней обработки из файлов XML
//
// Параметры:
//  ПроектEPF			 - 	 - 
//  ПутьИсходныхФайлов	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьФайлВнешнейОбработкиИзФайловXML(ДанныеДляФормированияФайла) Экспорт
	
	ИмяПроектаНаGitLab = ДанныеДляФормированияФайла.ИмяПроектаНаGitLab; //??
	ИмяФайла = ДанныеДляФормированияФайла.ИмяФайла; //Путь как я понимаю
	ПутьККаталогуРепозитория = ДанныеДляФормированияФайла.ПутьККаталогуРепозитория;
	ИмяСервераКластера1С = ДанныеДляФормированияФайла.ИмяСервераКластера1С;
	ИмяИнформационнойБазы = ДанныеДляФормированияФайла.ИмяИнформационнойБазы;
	ИмяПользователя = ДанныеДляФормированияФайла.ИмяПользователя;
	ПарольПользователя = ДанныеДляФормированияФайла.ПарольПользователя;
	ТипФайла = ДанныеДляФормированияФайла.ТипФайла;
	ИмяОбъекта = ДанныеДляФормированияФайла.ИмяОбъекта;
	ДополнениеПодключенияХранилища = "";

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(ТипФайла);
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("log");
	
	ЗапуститьПриложение(СтрШаблон(
		"%1\1cv8.exe DESIGNER /DisableStartupDialogs /DisableStartupMessages /S ""%4\%5"" /N""%6"" /P""%7"" %8 /LoadExternalDataProcessorOrReportFromFiles ""%2"" ""%3"" /Out ""%9""",
		Константы.ПутьКПапкеИсполняемыхФайлов1С.Получить(),
		СтрШаблон("%1\%2\%3.xml", 
			ПутьККаталогуРепозитория,
			РаботаСGit.ИмяФайлаБезРасширения(ИмяФайла),
			ИмяОбъекта),
		ИмяВременногоФайла,
		ИмяСервераКластера1С,
		ИмяИнформационнойБазы,
		ИмяПользователя,
		ПарольПользователя,
		ДополнениеПодключенияХранилища,
		ИмяФайлаЛога), , Истина);

	ДанныеВыводаПриложения = "";
	Попытка
		ЧтенияТекста = Новый ЧтениеТекста(ИмяФайлаЛога);
		ДанныеВыводаПриложения = ЧтенияТекста.Прочитать();
		ЧтенияТекста.Закрыть();
	Исключение
		// без обработки, значит не запустилось приложение
	КонецПопытки;
		
	ФайлEPF = Новый Файл(ИмяВременногоФайла);
	Если Не ФайлEPF.Существует() Тогда
		ВызватьИсключение СтрШаблон(
			"Ошибка формирования файла из XML файлов проекта, попробуйте повторить запрос позже!, 
			|
			|Данные для анализа:
			|%1", 
			ДанныеВыводаПриложения);
	КонецЕсли;
		
	Возврат Новый ДвоичныеДанные(ИмяВременногоФайла);
	
КонецФункции

// Функция - Ветка разработки сформировать файл внешней обработки из файлов XML
//
// Параметры:
//  ВеткаРазработки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВеткаРазработкиСформироватьФайлВнешнейОбработкиИзФайловXML(Знач ВеткаРазработки) Экспорт
	
	ДополнениеПодключенияХранилища = "";
	Если ЗначениеЗаполнено(ВеткаРазработки.Владелец.Владелец.АдресХранилища) Тогда
		ДополнениеПодключенияХранилища = СтрШаблон(
			"/ConfigurationRepositoryF ""%1"" /ConfigurationRepositoryN ""%2"" /ConfigurationRepositoryP ""%3""",
			ВеткаРазработки.Владелец.Владелец.АдресХранилища, ВеткаРазработки.Владелец.Владелец.ИмяПользователяХранилища,
			ВеткаРазработки.Владелец.Владелец.ПарольПользователяХранилища);
	КонецЕсли;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(ВеткаРазработки.Владелец.ТипФайла);
	ПутьККаталогуРепозитория = РаботаСGit.ПутьККаталогуРепозиторияВеткиРазработкиПроектовEPF(ВеткаРазработки);
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("log");
	
	ЗапуститьПриложение(СтрШаблон(
		"%1\1cv8.exe DESIGNER /DisableStartupDialogs /DisableStartupMessages /S ""%4\%5"" /N""%6"" /P""%7"" %8 /LoadExternalDataProcessorOrReportFromFiles ""%2"" ""%3"" /Out ""%9""",
		Константы.ПутьКПапкеИсполняемыхФайлов1С.Получить(),
		СтрШаблон("%1\%2\%3.xml", ПутьККаталогуРепозитория, 
			РаботаСGit.ИмяФайлаБезРасширения(ВеткаРазработки.Владелец.ИмяФайла),
			ВеткаРазработки.Владелец.ИмяОбъекта),
		ИмяВременногоФайла,
		ВеткаРазработки.Владелец.Владелец.ИмяСервераКластера1С,
		ВеткаРазработки.Владелец.Владелец.ИмяИнформационнойБазы,
		ВеткаРазработки.Владелец.Владелец.ИмяПользователя,
		ВеткаРазработки.Владелец.Владелец.ПарольПользователя,
		ДополнениеПодключенияХранилища,
		ИмяФайлаЛога), , Истина);

	ДанныеВыводаПриложения = "";
	Попытка
		ЧтенияТекста = Новый ЧтениеТекста(ИмяФайлаЛога);
		ДанныеВыводаПриложения = ЧтенияТекста.Прочитать();
		ЧтенияТекста.Закрыть();
	Исключение
		// без обработки, значит не запустилось приложение
	КонецПопытки;
		
	ФайлEPF = Новый Файл(ИмяВременногоФайла);
	Если Не ФайлEPF.Существует() Тогда
		ВызватьИсключение СтрШаблон(
			"Ошибка формирования файла из XML файлов проекта, попробуйте повторить запрос позже!, 
			|
			|Данные для анализа:
			|%1", 
			ДанныеВыводаПриложения);
	КонецЕсли;
	
	Возврат Новый ДвоичныеДанные(ИмяВременногоФайла);
	
КонецФункции

// Процедура - Ветка разработки выгрузить файл внешней обработки ВXML
//
// Параметры:
//  ВеткаРазработки		 - 	 - 
//  ДвоичныеДанныеФайла	 - 	 - 
//  Расщирение			 - 	 - 
//
Процедура ВеткаРазработкиВыгрузитьФайлВнешнейОбработкиВXML(Знач ВеткаРазработки, Знач ДвоичныеДанныеФайла, Знач Расщирение) Экспорт

	ДополнениеПодключенияХранилища = "";
	Если ЗначениеЗаполнено(ВеткаРазработки.Владелец.Владелец.АдресХранилища) Тогда
		ДополнениеПодключенияХранилища = СтрШаблон(
			"/ConfigurationRepositoryF ""%1"" /ConfigurationRepositoryN ""%2"" /ConfigurationRepositoryP ""%3""",
			ВеткаРазработки.Владелец.Владелец.АдресХранилища, ВеткаРазработки.Владелец.Владелец.ИмяПользователяХранилища,
			ВеткаРазработки.Владелец.Владелец.ПарольПользователяХранилища);
	КонецЕсли;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расщирение);
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	ПутьККаталогуРепозитория = РаботаСGit.ПутьККаталогуРепозиторияВеткиРазработкиПроектовEPF(ВеткаРазработки);
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("log");
	
	ЗапуститьПриложение(СтрШаблон(
		"%1\1cv8.exe DESIGNER /DisableStartupDialogs /DisableStartupMessages /S ""%4\%5"" /N""%6"" /P""%7"" %8 /DumpExternalDataProcessorOrReportToFiles ""%2"" ""%3"" /Out ""%9""",
		Константы.ПутьКПапкеИсполняемыхФайлов1С.Получить(),
		СтрШаблон("%1\%2\%3.xml", ПутьККаталогуРепозитория,
			РаботаСGit.ИмяФайлаБезРасширения(ВеткаРазработки.Владелец.ИмяФайла),
			ВеткаРазработки.Владелец.ИмяОбъекта),
		ИмяВременногоФайла,
		ВеткаРазработки.Владелец.Владелец.ИмяСервераКластера1С,
		ВеткаРазработки.Владелец.Владелец.ИмяИнформационнойБазы,
		ВеткаРазработки.Владелец.Владелец.ИмяПользователя,
		ВеткаРазработки.Владелец.Владелец.ПарольПользователя,
		ДополнениеПодключенияХранилища,
		ИмяФайлаЛога), , Истина);

	ДанныеВыводаПриложения = "";
	Попытка
		ЧтенияТекста = Новый ЧтениеТекста(ИмяФайлаЛога);
		ДанныеВыводаПриложения = ЧтенияТекста.Прочитать();
		ЧтенияТекста.Закрыть();
	Исключение
		// без обработки, значит не запустилось приложение
	КонецПопытки;
	
	// проверка на ошибки
	Если СтрНайти(ДанныеВыводаПриложения, "завершена") = 0 Тогда
		ВызватьИсключение СтрШаблон(
			"Ошибка формирования файла из XML файлов проекта, попробуйте повторить запрос позже!, 
			|
			|Данные для анализа:
			|%1", 
			ДанныеВыводаПриложения);
	КонецЕсли;
	
КонецПроцедуры
